InformationRegisters/ИдентификаторыДокументовНаРаботаВРоссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыДокументовНаРаботаВРоссии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайлПечатнойФормы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыДокументовНаРаботаВРоссии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИдентификаторДокумента(ПрисоединенныйФайл) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрисоединенныйФайл", ПрисоединенныйФайл);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаРегистра.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ИдентификаторыДокументовНаРаботаВРоссии КАК ТаблицаРегистра
		|ГДЕ
		|	ТаблицаРегистра.ПрисоединенныйФайл = &ПрисоединенныйФайл";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Идентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗапомнитьИдентификатор(ПрисоединенныйФайл, Идентификатор) Экспорт
	
	Запись = РегистрыСведений.ИдентификаторыДокументовНаРаботаВРоссии.СоздатьМенеджерЗаписи();
	Запись.ПрисоединенныйФайл = ПрисоединенныйФайл;
	Запись.Идентификатор = Идентификатор;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
